In [1]:
import pandas as pd
import numpy as np

In [2]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity='all'

# 데이터 변환 
- 단위 환산
- 자료형 변환

In [3]:
auto=pd.read_csv('데이터분석&시각화/workspace/pandas/data/auto_mpg.csv', header=None)
auto

auto.info()

        0  1      2      3       4     5   6  7                          8
0    18.0  8  307.0  130.0  3504.0  12.0  70  1  chevrolet chevelle malibu
1    15.0  8  350.0  165.0  3693.0  11.5  70  1          buick skylark 320
2    18.0  8  318.0  150.0  3436.0  11.0  70  1         plymouth satellite
3    16.0  8  304.0  150.0  3433.0  12.0  70  1              amc rebel sst
4    17.0  8  302.0  140.0  3449.0  10.5  70  1                ford torino
..    ... ..    ...    ...     ...   ...  .. ..                        ...
393  27.0  4  140.0  86.00  2790.0  15.6  82  1            ford mustang gl
394  44.0  4   97.0  52.00  2130.0  24.6  82  2                  vw pickup
395  32.0  4  135.0  84.00  2295.0  11.6  82  1              dodge rampage
396  28.0  4  120.0  79.00  2625.0  18.6  82  1                ford ranger
397  31.0  4  119.0  82.00  2720.0  19.4  82  1                 chevy s-10

[398 rows x 9 columns]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       398 non-null    float64
 1   1       398 non-null    int64
 2   2       398 non-null    float64
 3   3       398 non-null    object
 4   4       398 non-null    float64
 5   5       398 non-null    float64
 6   6       398 non-null    int64
 7   7       398 non-null    int64
 8   8       398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

Attribute Information:

1. mpg: continuous
2. cylinders: multi-valued discrete
3. displacement: continuous
4. horsepower: continuous
5. weight: continuous
6. acceleration: continuous
7. model year: multi-valued discrete
8. origin: multi-valued discrete
9. car name: string (unique for each instance)

In [4]:
#칼럼 지정
auto.columns=['mpg', 'cylinders', 'displacement',
             'horsepower', 'weight', 'acceleration', 
             'model_year', 'origin', 'car_name']
auto.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,car_name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino

### 1. 단위 환산
- mpg컬럼의 단위 환산 (mile per gallon)
- 1 mile = 1.60934km 
- 1 gallon = 3.75841L

In [5]:
auto['km/L']=round(auto.mpg*1.60934/3.75841, 2)
auto['km/L'].head()

0    7.71
1    6.42
2    7.71
3    6.85
4    7.28
Name: km/L, dtype: float64

### 2. 자료형 변환

In [6]:
auto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    float64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car_name      398 non-null    object
 9   km/L          398 non-null    float64
dtypes: float64(5), int64(3), object(2)
memory usage: 31.2+ KB

In [7]:
auto.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight          float64
acceleration    float64
model_year        int64
origin            int64
car_name         object
km/L            float64
dtype: object

In [8]:
#horsepower - 수치형이지만, 문자열로 저장되어 있음
#데이터 타입 변경 필요 !

In [9]:
auto.horsepower.unique()

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', '?', '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [10]:
auto.horsepower.isnull().sum()

0

In [11]:
auto.horsepower.value_counts()

150.0    22
90.00    20
88.00    19
110.0    18
100.0    17
         ..
61.00     1
93.00     1
148.0     1
152.0     1
82.00     1
Name: horsepower, Length: 94, dtype: int64

In [12]:
auto.horsepower.replace('?', np.nan, inplace = True)
auto.horsepower.isnull().sum()

6

In [13]:
auto.dropna(subset=['horsepower'], inplace=True)
auto.horsepower.unique()

array(['130.0', '165.0', '150.0', '140.0', '198.0', '220.0', '215.0',
       '225.0', '190.0', '170.0', '160.0', '95.00', '97.00', '85.00',
       '88.00', '46.00', '87.00', '90.00', '113.0', '200.0', '210.0',
       '193.0', '100.0', '105.0', '175.0', '153.0', '180.0', '110.0',
       '72.00', '86.00', '70.00', '76.00', '65.00', '69.00', '60.00',
       '80.00', '54.00', '208.0', '155.0', '112.0', '92.00', '145.0',
       '137.0', '158.0', '167.0', '94.00', '107.0', '230.0', '49.00',
       '75.00', '91.00', '122.0', '67.00', '83.00', '78.00', '52.00',
       '61.00', '93.00', '148.0', '129.0', '96.00', '71.00', '98.00',
       '115.0', '53.00', '81.00', '79.00', '120.0', '152.0', '102.0',
       '108.0', '68.00', '58.00', '149.0', '89.00', '63.00', '48.00',
       '66.00', '139.0', '103.0', '125.0', '133.0', '138.0', '135.0',
       '142.0', '77.00', '62.00', '132.0', '84.00', '64.00', '74.00',
       '116.0', '82.00'], dtype=object)

In [14]:
auto.horsepower=auto.horsepower.astype('float')
auto.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model_year    392 non-null    int64
 7   origin        392 non-null    int64
 8   car_name      392 non-null    object
 9   km/L          392 non-null    float64
dtypes: float64(6), int64(3), object(1)
memory usage: 33.7+ KB

In [15]:
# origin 컬럼 - 국가 이름을 코드화 
# 1, 2, 3 = USA, EU, JPN

In [16]:
auto.origin.unique()
auto.origin.replace({1:'USA', 2:'EU',3:'JPN'}, inplace=True)
auto.origin=auto.origin.astype('category')

array([1, 3, 2])

In [17]:
auto.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model_year    392 non-null    int64
 7   origin        392 non-null    category
 8   car_name      392 non-null    object
 9   km/L          392 non-null    float64
dtypes: category(1), float64(6), int64(2), object(1)
memory usage: 31.1+ KB

In [18]:
#model year 컬럼
auto.head()
auto.model_year.unique()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,car_name,km/L
0,18.0,8,307.0,130.0,3504.0,12.0,70,USA,chevrolet chevelle malibu,7.71
1,15.0,8,350.0,165.0,3693.0,11.5,70,USA,buick skylark 320,6.42
2,18.0,8,318.0,150.0,3436.0,11.0,70,USA,plymouth satellite,7.71
3,16.0,8,304.0,150.0,3433.0,12.0,70,USA,amc rebel sst,6.85
4,17.0,8,302.0,140.0,3449.0,10.5,70,USA,ford torino,7.28

array([70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82])

In [19]:
auto.model_year=auto.model_year.astype('category')
auto.model_year.unique()

[70, 71, 72, 73, 74, ..., 78, 79, 80, 81, 82]
Length: 13
Categories (13, int64): [70, 71, 72, 73, ..., 79, 80, 81, 82]

### 범주형 데이터 처리

###### 1. 구간분할(bining)

In [20]:
#horsepower : 저출력/보통출력/고출력 3구간으로 구간화(binning)

In [22]:
hist, bins = np.histogram(auto.horsepower, bins=3)
bins

array([ 46.        , 107.33333333, 168.66666667, 230.        ])

In [24]:
labels = ['저출력', '보통출력', '고출력']
auto['hp_bin'] = pd.cut(auto.horsepower, bins=bins, 
                       labels=labels,
                       include_lowest=True)
auto[['horsepower', 'hp_bin']]

     horsepower hp_bin
0         130.0   보통출력
1         165.0   보통출력
2         150.0   보통출력
3         150.0   보통출력
4         140.0   보통출력
..          ...    ...
393        86.0    저출력
394        52.0    저출력
395        84.0    저출력
396        79.0    저출력
397        82.0    저출력

[392 rows x 2 columns]

In [25]:
pd.get_dummies(auto.hp_bin)

     저출력  보통출력  고출력
0      0     1    0
1      0     1    0
2      0     1    0
3      0     1    0
4      0     1    0
..   ...   ...  ...
393    1     0    0
394    1     0    0
395    1     0    0
396    1     0    0
397    1     0    0

[392 rows x 3 columns]

###  정규화
- 숫자 데이터의 상대적인 크기 차이를 제거하기 위해, 데이터 값을 동일한 크기 기준으로 나눈 비율로 나타낸 변환
- 특성 벡터의 길이는 상관 없고 데이터의 방향만이 중요할 때 주로 사용

In [26]:
# 데이터를 |최대값|으로 나눔

In [27]:
auto.horsepower.dtypes

dtype('float64')

In [28]:
auto.horsepower.describe()

count    392.000000
mean     104.469388
std       38.491160
min       46.000000
25%       75.000000
50%       93.500000
75%      126.000000
max      230.000000
Name: horsepower, dtype: float64

In [31]:
hp1 = auto.horsepower / abs(auto.horsepower.max())
hp1.describe()

count    392.000000
mean       0.454215
std        0.167353
min        0.200000
25%        0.326087
50%        0.406522
75%        0.547826
max        1.000000
Name: horsepower, dtype: float64

In [35]:
# min-max scailing : 최소값은 0, 최대값은 1이 되도록 변환 
# 분모 : 최대 - 최소
# 분자 : 각 데이터 값 - 최소 

min_max = auto.horsepower.max()-auto.horsepower.min()
min_x = auto.horsepower - auto.horsepower.min()
hp2 = min_x/min_max
hp2
hp2.describe()

0      0.456522
1      0.646739
2      0.565217
3      0.565217
4      0.510870
         ...
393    0.217391
394    0.032609
395    0.206522
396    0.179348
397    0.195652
Name: horsepower, Length: 392, dtype: float64

count    392.000000
mean       0.317768
std        0.209191
min        0.000000
25%        0.157609
50%        0.258152
75%        0.434783
max        1.000000
Name: horsepower, dtype: float64

In [ ]:
# 표준화 
# 평균은 0, 표준편차는 1이 되도록 변환 
# 이상치 파악
# (주어진 데이터값 - 평균값) / 표준편차

In [36]:
hp3 = (auto.horsepower - auto.horsepower.mean()) / auto.horsepower.std()
hp3.describe()

count    3.920000e+02
mean    -3.231542e-16
std      1.000000e+00
min     -1.519034e+00
25%     -7.656144e-01
50%     -2.849846e-01
75%      5.593651e-01
max      3.261284e+00
Name: horsepower, dtype: float64

### 시계열 데이터 처리
- 날짜별로 수집된 데이터(금용, 날씨 등) 
- 시계열 데이터를 데이터 프레임의 행 인덱스로 사용하면, 시간으로 기록된 데이터 분석에 매우 용이함

In [ ]:
# 시계열 객체로 변환 - pd.to_datetime()

In [12]:
stock = pd.read_csv('NFLX.csv')

In [13]:
stock.head()

         Date      Open      High       Low     Close  Adj Close     Volume
0  2002-05-23  1.156429  1.242857  1.145714  1.196429   1.196429  104790000
1  2002-05-24  1.214286  1.225000  1.197143  1.210000   1.210000   11104800
2  2002-05-28  1.213571  1.232143  1.157143  1.157143   1.157143    6609400
3  2002-05-29  1.164286  1.164286  1.085714  1.103571   1.103571    6757800
4  2002-05-30  1.107857  1.107857  1.071429  1.071429   1.071429   10154200

In [14]:
stock.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4874 entries, 0 to 4873
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       4874 non-null   object
 1   Open       4874 non-null   float64
 2   High       4874 non-null   float64
 3   Low        4874 non-null   float64
 4   Close      4874 non-null   float64
 5   Adj Close  4874 non-null   float64
 6   Volume     4874 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 266.7+ KB

In [18]:
pd.to_datetime(stock.Date)
stock['new_date']=pd.to_datetime(stock.Date)
stock.info()

0      2002-05-23
1      2002-05-24
2      2002-05-28
3      2002-05-29
4      2002-05-30
          ...
4869   2021-09-24
4870   2021-09-27
4871   2021-09-28
4872   2021-09-29
4873   2021-09-30
Name: Date, Length: 4874, dtype: datetime64[ns]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4874 entries, 0 to 4873
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       4874 non-null   object
 1   Open       4874 non-null   float64
 2   High       4874 non-null   float64
 3   Low        4874 non-null   float64
 4   Close      4874 non-null   float64
 5   Adj Close  4874 non-null   float64
 6   Volume     4874 non-null   int64
 7   new_date   4874 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(5), int64(1), object(1)
memory usage: 304.8+ KB

In [19]:
stock.new_date[0]

Timestamp('2002-05-23 00:00:00')

In [22]:
#행 인덱스로 저장
stock.set_index('new_date', inplace=True)

KeyError: "None of ['new_date'] are in the columns"

In [23]:
stock.head()

,Date,Open,High,Low,Close,Adj Close,Volume
new_date,,,,,,,
2002-05-23,2002-05-23,1.156429,1.242857,1.145714,1.196429,1.196429,104790000
2002-05-24,2002-05-24,1.214286,1.225000,1.197143,1.210000,1.210000,11104800
2002-05-28,2002-05-28,1.213571,1.232143,1.157143,1.157143,1.157143,6609400
2002-05-29,2002-05-29,1.164286,1.164286,1.085714,1.103571,1.103571,6757800
2002-05-30,2002-05-30,1.107857,1.107857,1.071429,1.071429,1.071429,10154200

In [24]:
stock.drop('Date', axis=1, inplace=True)

In [25]:
stock.head()

                Open      High       Low     Close  Adj Close     Volume
new_date
2002-05-23  1.156429  1.242857  1.145714  1.196429   1.196429  104790000
2002-05-24  1.214286  1.225000  1.197143  1.210000   1.210000   11104800
2002-05-28  1.213571  1.232143  1.157143  1.157143   1.157143    6609400
2002-05-29  1.164286  1.164286  1.085714  1.103571   1.103571    6757800
2002-05-30  1.107857  1.107857  1.071429  1.071429   1.071429   10154200

In [27]:
stock.index

DatetimeIndex(['2002-05-23', '2002-05-24', '2002-05-28', '2002-05-29',
               '2002-05-30', '2002-05-31', '2002-06-03', '2002-06-04',
               '2002-06-05', '2002-06-06',
               ...
               '2021-09-17', '2021-09-20', '2021-09-21', '2021-09-22',
               '2021-09-23', '2021-09-24', '2021-09-27', '2021-09-28',
               '2021-09-29', '2021-09-30'],
              dtype='datetime64[ns]', name='new_date', length=4874, freq=None)

In [28]:
stock.loc['2018-06']

,Open,High,Low,Close,Adj Close,Volume
new_date,,,,,,
2018-06-01,353.880005,359.989990,352.820007,359.929993,359.929993,7112300
2018-06-04,362.679993,363.000000,355.510010,361.809998,361.809998,7682000
2018-06-05,363.320007,369.829987,361.410004,365.799988,365.799988,8358000
2018-06-06,367.779999,369.679993,363.329987,367.450012,367.450012,7712300
2018-06-07,368.540009,368.700012,357.799988,361.399994,361.399994,8278000
2018-06-08,358.059998,362.390015,356.250000,360.570007,360.570007,5225700
2018-06-11,361.880005,365.670013,360.910004,361.450012,361.450012,4432400
2018-06-12,363.600006,365.980011,362.000000,363.829987,363.829987,4291000
2018-06-13,367.529999,384.250000,364.109985,379.929993,379.929993,18222800
2018-06-14,384.269989,395.029999,383.250000,392.869995,392.869995,14598300
2018-06-15,390.709991,398.859985,387.510010,391.980011,391.980011,13588100
2018-06-18,387.720001,393.160004,386.500000,390.399994,390.399994,6824800
2018-06-19,389.500000,405.290009,388.500000,404.980011,404.980011,16697100
2018-06-20,415.149994,419.470001,409.600006,416.760010,416.760010,16494600
2018-06-21,421.380005,423.209991,406.369995,415.440002,415.440002,18389900
2018-06-22,419.980011,420.500000,409.649994,411.089996,411.089996,10428600
2018-06-25,404.690002,405.989990,378.750000,384.480011,384.480011,22490900
2018-06-26,393.279999,404.779999,389.049988,399.390015,399.390015,15191200
2018-06-27,407.559998,411.589996,390.000000,390.390015,390.390015,16541400
2018-06-28,395.000000,396.899994,387.100006,395.420013,395.420013,12219900
2018-06-29,399.190002,401.329987,390.549988,391.429993,391.429993,9252500

In [29]:
stock['2018-06']

/var/folders/p9/8hvxfvwd1cbfjjyrzwqff47m0000gn/T/ipykernel_1465/3181603086.py:1: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  stock['2018-06']

,Open,High,Low,Close,Adj Close,Volume
new_date,,,,,,
2018-06-01,353.880005,359.989990,352.820007,359.929993,359.929993,7112300
2018-06-04,362.679993,363.000000,355.510010,361.809998,361.809998,7682000
2018-06-05,363.320007,369.829987,361.410004,365.799988,365.799988,8358000
2018-06-06,367.779999,369.679993,363.329987,367.450012,367.450012,7712300
2018-06-07,368.540009,368.700012,357.799988,361.399994,361.399994,8278000
2018-06-08,358.059998,362.390015,356.250000,360.570007,360.570007,5225700
2018-06-11,361.880005,365.670013,360.910004,361.450012,361.450012,4432400
2018-06-12,363.600006,365.980011,362.000000,363.829987,363.829987,4291000
2018-06-13,367.529999,384.250000,364.109985,379.929993,379.929993,18222800
2018-06-14,384.269989,395.029999,383.250000,392.869995,392.869995,14598300
2018-06-15,390.709991,398.859985,387.510010,391.980011,391.980011,13588100
2018-06-18,387.720001,393.160004,386.500000,390.399994,390.399994,6824800
2018-06-19,389.500000,405.290009,388.500000,404.980011,404.980011,16697100
2018-06-20,415.149994,419.470001,409.600006,416.760010,416.760010,16494600
2018-06-21,421.380005,423.209991,406.369995,415.440002,415.440002,18389900
2018-06-22,419.980011,420.500000,409.649994,411.089996,411.089996,10428600
2018-06-25,404.690002,405.989990,378.750000,384.480011,384.480011,22490900
2018-06-26,393.279999,404.779999,389.049988,399.390015,399.390015,15191200
2018-06-27,407.559998,411.589996,390.000000,390.390015,390.390015,16541400
2018-06-28,395.000000,396.899994,387.100006,395.420013,395.420013,12219900
2018-06-29,399.190002,401.329987,390.549988,391.429993,391.429993,9252500

In [30]:
stock.loc['2018-6':'2018-07']

,Open,High,Low,Close,Adj Close,Volume
new_date,,,,,,
2018-06-01,353.880005,359.989990,352.820007,359.929993,359.929993,7112300
2018-06-04,362.679993,363.000000,355.510010,361.809998,361.809998,7682000
2018-06-05,363.320007,369.829987,361.410004,365.799988,365.799988,8358000
2018-06-06,367.779999,369.679993,363.329987,367.450012,367.450012,7712300
2018-06-07,368.540009,368.700012,357.799988,361.399994,361.399994,8278000
2018-06-08,358.059998,362.390015,356.250000,360.570007,360.570007,5225700
2018-06-11,361.880005,365.670013,360.910004,361.450012,361.450012,4432400
2018-06-12,363.600006,365.980011,362.000000,363.829987,363.829987,4291000
2018-06-13,367.529999,384.250000,364.109985,379.929993,379.929993,18222800
2018-06-14,384.269989,395.029999,383.250000,392.869995,392.869995,14598300
2018-06-15,390.709991,398.859985,387.510010,391.980011,391.980011,13588100
2018-06-18,387.720001,393.160004,386.500000,390.399994,390.399994,6824800
2018-06-19,389.500000,405.290009,388.500000,404.980011,404.980011,16697100
2018-06-20,415.149994,419.470001,409.600006,416.760010,416.760010,16494600
2018-06-21,421.380005,423.209991,406.369995,415.440002,415.440002,18389900
2018-06-22,419.980011,420.500000,409.649994,411.089996,411.089996,10428600
2018-06-25,404.690002,405.989990,378.750000,384.480011,384.480011,22490900
2018-06-26,393.279999,404.779999,389.049988,399.390015,399.390015,15191200
2018-06-27,407.559998,411.589996,390.000000,390.390015,390.390015,16541400
2018-06-28,395.000000,396.899994,387.100006,395.420013,395.420013,12219900
2018-06-29,399.190002,401.329987,390.549988,391.429993,391.429993,9252500
2018-07-02,385.450012,398.380005,380.000000,398.179993,398.179993,8142500
2018-07-03,399.489990,399.980011,389.500000,390.519989,390.519989,5280300
2018-07-05,393.799988,399.239990,390.859985,398.390015,398.390015,8448900
2018-07-06,397.450012,408.649994,395.519989,408.250000,408.250000,8629600
2018-07-09,415.950012,419.119995,411.100006,418.970001,418.970001,11127500
2018-07-10,417.239990,419.440002,413.079987,415.630005,415.630005,9382900
2018-07-11,411.339996,419.769989,410.600006,418.649994,418.649994,9713900
2018-07-12,415.160004,416.790009,407.799988,413.500000,413.500000,12743300
2018-07-13,409.190002,410.000000,395.079987,395.799988,395.799988,15719000
2018-07-16,398.980011,403.359985,391.750000,400.480011,400.480011,22960000
2018-07-17,346.950012,385.000000,344.000000,379.480011,379.480011,58410400
2018-07-18,381.239990,383.130005,372.359985,375.130005,375.130005,21746300
2018-07-19,371.059998,375.750000,363.000000,364.230011,364.230011,16878700
2018-07-20,364.920013,370.500000,360.140015,361.049988,361.049988,15096700
2018-07-23,359.149994,363.899994,353.600006,362.660004,362.660004,11505200
2018-07-24,366.940002,367.399994,354.559998,357.320007,357.320007,12851500
2018-07-25,357.570007,363.279999,355.649994,362.869995,362.869995,8467800
2018-07-26,358.190002,365.540009,356.630005,363.089996,363.089996,6993700
2018-07-27,366.850006,367.000000,351.649994,355.209991,355.209991,8949500
2018-07-30,351.929993,352.029999,334.019989,334.959991,334.959991,18260700
2018-07-31,331.510010,342.500000,328.000000,337.450012,337.450012,14085400

In [31]:
stock.loc['2018-06-25':'2018-07-10']

,Open,High,Low,Close,Adj Close,Volume
new_date,,,,,,
2018-06-25,404.690002,405.989990,378.750000,384.480011,384.480011,22490900
2018-06-26,393.279999,404.779999,389.049988,399.390015,399.390015,15191200
2018-06-27,407.559998,411.589996,390.000000,390.390015,390.390015,16541400
2018-06-28,395.000000,396.899994,387.100006,395.420013,395.420013,12219900
2018-06-29,399.190002,401.329987,390.549988,391.429993,391.429993,9252500
2018-07-02,385.450012,398.380005,380.000000,398.179993,398.179993,8142500
2018-07-03,399.489990,399.980011,389.500000,390.519989,390.519989,5280300
2018-07-05,393.799988,399.239990,390.859985,398.390015,398.390015,8448900
2018-07-06,397.450012,408.649994,395.519989,408.250000,408.250000,8629600
2018-07-09,415.950012,419.119995,411.100006,418.970001,418.970001,11127500
2018-07-10,417.239990,419.440002,413.079987,415.630005,415.630005,9382900

In [32]:
#period 객체로 변환 
dates = ['2019-01-01', '2020-03-01', '2021-06-01']
ts_dates = pd.to_datetime(dates)
ts_dates

DatetimeIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='datetime64[ns]', freq=None)

In [33]:
ts_dates.to_period(freq='A')

PeriodIndex(['2019', '2020', '2021'], dtype='period[A-DEC]')

In [35]:
ts_dates.to_period(freq='3H')

PeriodIndex(['2019-01-01 00:00', '2020-03-01 00:00', '2021-06-01 00:00'], dtype='period[3H]')

In [4]:
# 시계열 데이터 생성
# Timestamp 배열 - date_range()함수 사용 
pd.date_range(start='2023-02-02', periods=6, freq='MS', tz='Asia/Seoul')

DatetimeIndex(['2023-03-01 00:00:00+09:00', '2023-04-01 00:00:00+09:00',
               '2023-05-01 00:00:00+09:00', '2023-06-01 00:00:00+09:00',
               '2023-07-01 00:00:00+09:00', '2023-08-01 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='MS')

In [5]:
pd.date_range(start='2023-02-02', periods=6, freq='3M')

DatetimeIndex(['2023-02-28', '2023-05-31', '2023-08-31', '2023-11-30',
               '2024-02-29', '2024-05-31'],
              dtype='datetime64[ns]', freq='3M')

In [7]:
#period 배열 생성 : period_range() 함수 사용
pd.period_range(start='2023-02-02', periods=3, freq='M')

PeriodIndex(['2023-02', '2023-03', '2023-04'], dtype='period[M]')

### 시계열 데이터 활용
- 날짜 데이터 분리

In [10]:
stock = pd.read_csv('NFLX.csv')
stock.head()
stock.info()

         Date      Open      High       Low     Close  Adj Close     Volume
0  2002-05-23  1.156429  1.242857  1.145714  1.196429   1.196429  104790000
1  2002-05-24  1.214286  1.225000  1.197143  1.210000   1.210000   11104800
2  2002-05-28  1.213571  1.232143  1.157143  1.157143   1.157143    6609400
3  2002-05-29  1.164286  1.164286  1.085714  1.103571   1.103571    6757800
4  2002-05-30  1.107857  1.107857  1.071429  1.071429   1.071429   10154200

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4874 entries, 0 to 4873
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       4874 non-null   object
 1   Open       4874 non-null   float64
 2   High       4874 non-null   float64
 3   Low        4874 non-null   float64
 4   Close      4874 non-null   float64
 5   Adj Close  4874 non-null   float64
 6   Volume     4874 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 266.7+ KB

In [16]:
pd.to_datetime(stock.Date)
stock['new_date']=pd.to_datetime(stock.Date)
stock.new_date

0      2002-05-23
1      2002-05-24
2      2002-05-28
3      2002-05-29
4      2002-05-30
          ...
4869   2021-09-24
4870   2021-09-27
4871   2021-09-28
4872   2021-09-29
4873   2021-09-30
Name: Date, Length: 4874, dtype: datetime64[ns]

0      2002-05-23
1      2002-05-24
2      2002-05-28
3      2002-05-29
4      2002-05-30
          ...
4869   2021-09-24
4870   2021-09-27
4871   2021-09-28
4872   2021-09-29
4873   2021-09-30
Name: new_date, Length: 4874, dtype: datetime64[ns]

In [18]:
stock['Year']=stock.new_date.dt.year
stock['Month']=stock.new_date.dt.month
stock['Day']=stock.new_date.dt.day
stock.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume',
       'new_date', 'Year', 'Month', 'Day'],
      dtype='object')